package seminar1.task1;

import java.lang.reflect.Array;

public class Answer {
    public static void arrayOutOfBoundsException() {
        // Напишите свое решение ниже
        int[] array=new int[]{1,2,3,4,5};
        System.out.println(array[5]);

    }

    public static void divisionByZero() {
        // Напишите свое решение ниже

    }

    public static void numberFormatException() {
        // Напишите свое решение ниже

    }
}
