package seminar1.task1;

public class Answer {
    public static void arrayOutOfBoundsException() {
        // Напишите свое решение ниже
        int[] array = new int[]{1, 2, 3, 4, 5};
        System.out.println(array[5]);

    }

    public static void divisionByZero() {
        // Напишите свое решение ниже
        int divByZero = 1 / 0;

    }

    public static void numberFormatException() {
        // Напишите свое решение ниже

    }
}
